app/controllers/customers_controller.rb

  def index
    if install_signed_in?
    @customers = Customer.all
---
SELECT `customers`.* FROM `customers`

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO `customers` (`name`, `email`, `phone`, `address`, `created_at`, `updated_at`) VALUES ('steven smith', 'steve.smith@gmail.com', '7870955684', '4/234,park avenue,sydney', '2023-02-20 07:25:22', '2023-02-20 07:25:22')

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE `customers` SET `address` = '2/13,mike avenue,london', `updated_at` = '2023-02-20 07:54:26' WHERE `customers`.`id` = 2

  def destroy
    @customer.destroy
---
DELETE FROM `customers` WHERE `customers`.`id` = 2